T1 = int(input('Введите T1:'))
T2 = int(input('Введите T2:'))
T3 = int(input('Введите T3:'))

s_time = 1000
inject_cnt = 0

t1, t2, t3, dt1, dt2, dt3 = 0, 0, 0, 1, 0, 0
s1, s2, ds1, ds2 = '', '', 'N', '.'

for i in range(s_time):
    t1, t2, t3 = t1 + dt1, t2 + dt2, t3 + dt3
    s1, s2 = s1 + ds1, s2 + ds2

    if t1 == T1:
        # Если шприц набран
        if t3 == 0:
            # Переходим к этапу передачи баяна
            t1 = 0
            dt1, dt2, dt3 = 0, 1, 0
            ds1 = 'p'
        if t3 > 0:
            # Ждём, пока закончится инъекция
            dt1 = 0
            ds1 = '.'

    if t2 == T2:
        # Когда окончен этап передачи баяна
        t2 = 0
        dt1, dt2, dt3 = 1, 0, 1
        ds1, ds2 = 'N', 'I'

    if t3 == T3:
        # Когда инъекция закончена
        inject_cnt += 1
        t3, dt3 = 0, 0
        ds2 = '.'
        if t1 == T1:
            # Если новый шприц уже набран, сразу на передачу
            t1, dt2 = 0, 1
            ds1 = 'p'


print('1:', s1)
print('2:', s2)
print('Среднее время между инъекциями:',
      round(s_time / inject_cnt, 3),
      'сек.')
